## Stack - Projeto Human Resources Analytics

### Modelagem de Dados.

#### Importando as bibliotecas necessárias.

In [1]:
# Estrutura de dados.
import pandas as pd

# Operações com objetos temporais.
import datetime

# Leitura de arquivos.
import glob

# Operações matemáticas.
import math

#### Conexão com o banco de dados.

In [2]:
# Importando função para conexão com o banco de dados.
from sqlalchemy.engine import create_engine

# Referenciando o banco de dados local.
engine = create_engine("mysql+pymysql://root:bootcamp@127.0.0.1:3307/employees")

### Criação dos atributos **satisfaction_level** e **last_evaluation**.

#### Carregando os dados de avaliação de desempenho.

In [3]:
# Lendo o arquivo .json da persistência local performance-evaluation do datalake.
df_performance_evaluation = pd.read_json(
    "../datalake/landing/performance-evaluation/employee_performance_evaluation.json",
    orient="records",
    lines=True,
)

In [4]:
df_performance_evaluation.head()

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

### Criando o atributo **number_project**.

#### Definindo a query para retorna o número de projetos por colaborador.

In [5]:
query = """SELECT Count(PROJECT_ID) as number_projects
FROM projects_emp
GROUP BY (emp_id);"""

In [6]:
# Realizando a query no banco de dados.
df_number_projects = pd.read_sql_query(query, engine)

In [7]:
df_number_projects.head()

   number_projects
0                2
1                5
2                7
3                5
4                2

### Criação do atributo **mean_work_last_3_months**.

#### Criando uma estrutura de Dataframe vazia.

In [8]:
df_sistema_ponto = pd.DataFrame(data=None, columns=["emp_id", "data", "hora"])

#### Carregando os dados do registro de horas trabalhadas.

In [9]:
# Iterando todos os arquivos .xlsx na persistência working-hours local do datalake.
for sheet in glob.glob("../datalake/landing/working-hours/*.xlsx"):

    # Lendo o arquivo iterado.
    df_ = pd.read_excel(sheet)

    # Concatenando todos os arquivos.
    df_sistema_ponto = pd.concat([df_sistema_ponto, df_])

In [10]:
df_sistema_ponto.head()

    emp_id       data  hora
0  20001.0 2020-05-31  10.0
1  20001.0 2020-06-01  11.0
2  20001.0 2020-06-02   4.0
3  20001.0 2020-06-03   7.0
4  20001.0 2020-06-04   7.0

#### Convertendo os tipos dos atributos

In [11]:
df_sistema_ponto["hora"] = pd.to_numeric(df_sistema_ponto["hora"])
df_sistema_ponto["emp_id"] = df_sistema_ponto["emp_id"].map(lambda x: int(x))

#### Filtrando apenas os registros dos últimos 3 meses.

In [12]:
df_last_3_month = df_sistema_ponto[
    (df_sistema_ponto["data"] > datetime.datetime(2020, 9, 30))
]

#### Verificando a contagem de registros por colaborador.

In [13]:
df_last_3_month.groupby("emp_id").count().head()

        data  hora
emp_id
10001     92    92
10002     92    92
10003     92    92
10004     92    92
10005     92    92

#### Calculando o valor médio da quantidade de horas nos últimos 3 meses.

In [14]:
mean_work_last_3_months = df_last_3_month.groupby("emp_id")["hora"].sum() / 3

#### Atribuindo os dados ao Dataframe para a verificação.

In [15]:
mean_work_last_3_months = pd.DataFrame(data=mean_work_last_3_months)
mean_work_last_3_months.rename(
    columns={"hora": "mean_work_last_3_months"}, inplace=True
)

In [16]:
mean_work_last_3_months.head()

        mean_work_last_3_months
emp_id
10001                266.000000
10002                252.000000
10003                289.666667
10004                275.666667
10005                292.333333

### Criando o atributo **time_in_company**.

#### Definindo uma data de referência.

In [17]:
date_referencia = datetime.date(2021, 1, 1)

#### Definindo a query para retornar os dados do banco de dados.

In [18]:
query = """SELECT emp_no, hire_date
FROM employees;"""

In [19]:
df_hire_date = pd.read_sql_query(query, engine)

In [20]:
df_hire_date.head()

   emp_no   hire_date
0   10001  2018-01-17
1   10002  2015-02-02
2   10003  2017-01-22
3   10004  2016-01-28
4   10005  2018-01-17

#### Convertendo o tipo de dados para datetime.

In [21]:
df_hire_date["hire_date"] = pd.to_datetime(df_hire_date["hire_date"])

#### Calculando a diferença em dias a partir da data de contratação do colaborador até a data de referência.

In [22]:
days_diff = []

# Iterando todas as datas de contratação.
for d in df_hire_date["hire_date"]:

    # Diferença em relação à referência.
    diff = date_referencia - d.date()

    # Concatenação.
    days_diff.append(diff.days)

days_diff[:10]

[1080, 2160, 1440, 1800, 1080, 1080, 1440, 1800, 1800, 1080]

#### Convertendo o número de dias em quantidade de anos.

In [23]:
nyears = []
for ndays in days_diff:

    # Conversão para ano arredondada para cima.
    nyears.append(int(math.ceil(ndays / 365)))

nyears[:10]

[3, 6, 4, 5, 3, 3, 4, 5, 5, 3]

#### Atribuindo os dados ao Dataframe para verificação.

In [24]:
df_hire_date["time_in_company"] = nyears

In [25]:
df_hire_date.head()

   emp_no  hire_date  time_in_company
0   10001 2018-01-17                3
1   10002 2015-02-02                6
2   10003 2017-01-22                4
3   10004 2016-01-28                5
4   10005 2018-01-17                3

### Criando o atributo **work_accident**.

#### Carregando os dados a partir do banco de dados.

In [26]:
df_employees = pd.read_sql_table("employees", engine)
df_accident = pd.read_sql_table("accident", engine)

#### Verificando quais colaboradores sofreram acidente.

In [27]:
work_accident = []

# Iterando os funcionários por ID.
for emp in df_employees["emp_no"]:

    # Condição de acidentado.
    if emp in df_accident["emp_no"].to_list():
        work_accident.append(1)
    else:
        work_accident.append(0)

#### Atribuindo ao Dataframe para verificação.

In [28]:
df_work_accident = pd.DataFrame(data=None, columns=["work_accident"])
df_work_accident["work_accident"] = work_accident

In [29]:
df_work_accident.head()

   work_accident
0              0
1              0
2              0
3              0
4              0

### Criando os atributos **department**, **salary** e **left**.

#### Definindo a query para retornar os atributos.

In [30]:
# Consulta múltipla em SQL usando INNER JOIN.
query = """SELECT emp.department as department, sal.salary as salary, emp.left
FROM employees emp
INNER JOIN salaries sal
ON emp.emp_no = sal.emp_id;
"""

In [31]:
df_department_salary_left = pd.read_sql_query(query, engine)

In [32]:
df_department_salary_left.head()

  department  salary  left
0      sales     low     1
1      sales  medium     1
2      sales  medium     1
3      sales     low     1
4      sales     low     1